JavaScript/dojo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>dojo</title>
<!-- 2013-07-17 周三 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">dojo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. dojo初步</a>
<ul>
<li><a href="#sec-1-1">1.1. 结构</a></li>
<li><a href="#sec-1-2">1.2. 小部件的添加</a></li>
<li><a href="#sec-1-3">1.3. 小部件与事件的关联</a></li>
<li><a href="#sec-1-4">1.4. 获取服务器数据</a></li>
<li><a href="#sec-1-5">1.5. get方法传送数据</a></li>
<li><a href="#sec-1-6">1.6. 通过id获取表单元素值的方法</a></li>
<li><a href="#sec-1-7">1.7. post方法提交</a></li>
</ul>
</li>
<li><a href="#sec-2">2. dijit小部件库</a>
<ul>
<li><a href="#sec-2-1">2.1. 实现方式</a></li>
<li><a href="#sec-2-2">2.2. 属性 方法 扩展点</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 属性</a></li>
<li><a href="#sec-2-2-2">2.2.2. 方法</a></li>
<li><a href="#sec-2-2-3">2.2.3. 扩展点</a></li>
<li><a href="#sec-2-2-4">2.2.4. 例子</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. 复选框</a></li>
<li><a href="#sec-2-4">2.4. 单选框</a></li>
<li><a href="#sec-2-5">2.5. 标签</a></li>
<li><a href="#sec-2-6">2.6. 表格</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 与javaScipt的协作</a>
<ul>
<li><a href="#sec-3-1">3.1. 基本函数</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. dojo.require</a></li>
<li><a href="#sec-3-1-2">3.1.2. dojo.addOnLoad</a></li>
<li><a href="#sec-3-1-3">3.1.3. dojo.byId dijit.byId</a></li>
<li><a href="#sec-3-1-4">3.1.4. dojo.query</a></li>
<li><a href="#sec-3-1-5">3.1.5. dojo.connect</a></li>
<li><a href="#sec-3-1-6">3.1.6. dojo.forEach</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. dom</a>
<ul>
<li><a href="#sec-4-1">4.1. dojo DOM工具函数</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> dojo初步</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 结构</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>导入dojo库
</li>
<li>运行在服务器上
</li>
<li>页面html代码
<ul class="org-ul">
<li>css
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">style</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/css"</span>&gt;
@import <span style="color: #8b2252;">"dojo&#30446;&#24405;/themes/&#26679;&#24335;&#25991;&#20214;&#21517;&#31216;"</span>
@import <span style="color: #8b2252;">"dojo&#30446;&#24405;/themes/dojo.css"</span>
&lt;/<span style="color: #0000ff;">style</span>&gt;
</pre>
</div>
</li>
<li>dojo.js的导入
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"dojo&#30446;&#24405;/dojo.dojo.js"</span> <span style="color: #a0522d;">djConfig</span>=<span style="color: #8b2252;">"parseOnLoad:true"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 小部件的添加</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>脚本添加
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javacript"</span>&gt; 
  dojo.require(<span style="color: #8b2252;">"dojo.form...dojo&#20013;&#23545;&#24212;&#30340;&#21253;&#21517;&#21644;&#37096;&#20214;&#21517;"</span>);
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>
</div>
<ul class="org-ul">
<li>html代码(比如按钮)
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">button</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.Button"</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"&#25353;&#38062;&#30340;id"</span>&gt;&#25353;&#38062;&#19978;&#26174;&#31034;&#30340;&#21517;&#31216;&lt;/<span style="color: #0000ff;">button</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 小部件与事件的关联</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>脚本标签
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html"> &lt;<span style="color: #0000ff;">button</span> <span style="color: #a0522d;">do-jo-type</span>=<span style="color: #8b2252;">"dijit.form.Button"</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"&#25353;&#38062;&#30340;id"</span>&gt;
 &#25353;&#38062;&#30340;&#21517;&#31216;
 &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"dojo.method"</span> <span style="color: #a0522d;">event</span>=<span style="color: #8b2252;">"onClick"</span>&gt;
   alert(<span style="color: #8b2252;">"You pressed the button!"</span>);
 &lt;/<span style="color: #0000ff;">script</span>&gt;
&lt;/<span style="color: #0000ff;">button</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 获取服务器数据</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>回调函数处理数据
</li>
<li>按钮触发请求
</li>
<li>例子
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">script</span>&gt;
  function &#25104;&#21151;&#26041;&#27861;();
  function &#22833;&#36133;&#26041;&#27861;(); 

  dojo.xhrGet({
   url: '&#35775;&#38382;&#22320;&#22336;',
   load: &#25104;&#21151;&#26041;&#27861;,
   error:&#22833;&#36133;&#26041;&#27861;
 });
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> get方法传送数据</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>参数的传递
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">dojo.xhrGet({
  url: <span style="color: #8b2252;">"&#26381;&#21153;&#22120;&#22320;&#22336;"</span>,
  load: &#25104;&#21151;&#26041;&#27861;,
  error: &#22833;&#36133;&#26041;&#27861;,
  content:{&#21442;&#25968;&#21517;&#31216;:&#21442;&#25968;&#20540;}
});
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 通过id获取表单元素值的方法</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>dojo.byId(id名称).value;
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> post方法提交</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>提交方法 xhrPost()
</li>
<li>参数为form属性
</li>
<li>例子
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">dojo.xhrPost({
 url: <span style="color: #8b2252;">"&#26381;&#21153;&#22120;&#22320;&#22336;"</span>,
 load:&#25104;&#21151;&#26041;&#27861;,
 error:&#22833;&#36133;&#26041;&#27861;,
 form:<span style="color: #8b2252;">"formid"</span>
});
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> dijit小部件库</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 实现方式</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>html标签使用特殊属性的声明
</li>
<li>js
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 属性 方法 扩展点</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 属性</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>是用来控制显示或行为的数据元素
</li>
<li>只能在创建的时候设置一次
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 方法</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>控制某些事情的函数
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> 扩展点</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>可重构的函数
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> 例子</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">

<pre class="src src-html"> &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.ValidatingTextBox"</span> <span style="color: #a0522d;">isValid</span>=<span style="color: #8b2252;">"my.form.isValid"</span>...&gt;
    &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"dojo/method"</span> <span style="color: #a0522d;">event</span>=<span style="color: #8b2252;">"isValid"</span>&gt;
     &#25193;&#23637;&#30340;&#26041;&#27861;
   &lt;/<span style="color: #0000ff;">script</span>&gt;
 &lt;<span style="color: #0000ff;">div</span>&gt;
 <span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#36890;&#29992;&#26041;&#27861; </span><span style="color: #b22222;">--&gt;</span>
my.form.isValid = function(isFocused){
   &#25193;&#23637;&#26041;&#27861; 
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 复选框</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>代码
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">  &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"dojo.js&#23436;&#25972;&#36335;&#24452;"</span>&gt;
    dojo.require(<span style="color: #8b2252;">"dojo.parser"</span>);
    dojo.require(<span style="color: #8b2252;">"dijit.form.CheckBox"</span>); 
  &lt;/<span style="color: #0000ff;">script</span>&gt;

&lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"cb"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.CheckBox"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"developer"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"on"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"checkbox"</span>/&gt;
  &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"cb"</span>&gt;&#20320;&#26159;&#31243;&#24207;&#21592;&#21527;?&lt;/<span style="color: #0000ff;">label</span>&gt;
&lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"cb1"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.CheckBox"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"developer"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"on"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"checkbox"</span>/&gt;
 &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"cb1"</span>&gt;&#20320;&#26159;&#21307;&#29983;&#21527;?&lt;/<span style="color: #0000ff;">label</span>&gt;
 &lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"cb2"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.CheckBox"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"developer"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"on"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"checkbox"</span>/&gt;
&lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"cb2"</span>&gt;&#20320;&#26159;&#20027;&#24109;&#21527;?&lt;/<span style="color: #0000ff;">label</span>&gt;
 &lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"cb3"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.CheckBox"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"developer"</span>  <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"on"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"checkbox"</span>/&gt;
 &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"cb3"</span>&gt;&#20320;&#26159;&#20013;&#22269;&#20154;&#21527;?&lt;/<span style="color: #0000ff;">label</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 单选框</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>代码
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">   &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"dojo.js&#23436;&#25972;&#36335;&#24452;"</span>&gt;
   dojo.require(<span style="color: #8b2252;">"dojo.parser"</span>);
   dojo.require(<span style="color: #8b2252;">"dijit.form.CheckBox"</span>); 
 &lt;/<span style="color: #0000ff;">script</span>&gt;
&lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.RadioButton"</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"sum1"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"album"</span>    <span style="color: #a0522d;">checked</span>=<span style="color: #8b2252;">"checked"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"metallica"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"radio"</span> /&gt;  &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"sum1"</span>&gt; Metallica &lt;/<span style="color: #0000ff;">label</span>&gt; 
&lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.RadioButton"</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"sum2"</span>  <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"album"</span>   <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"Extreme"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"radio"</span> /&gt; &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"sum2"</span>&gt; Extreme &lt;/<span style="color: #0000ff;">label</span>&gt; 
&lt;<span style="color: #0000ff;">input</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.form.RadioButton"</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"sum3"</span>  <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"album"</span>   <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"Slayer"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"radio"</span> /&gt; &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">for</span>=<span style="color: #8b2252;">"sum3"</span>&gt; Slayer &lt;/<span style="color: #0000ff;">label</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 标签</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>代码
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html"> &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"dojo.js&#23436;&#25972;&#36335;&#24452;"</span>&gt;
    dojo.require(<span style="color: #8b2252;">"dojo.parser"</span>);

dojo.require(<span style="color: #8b2252;">"dijit.layout.TabContainer"</span>);
    dojo.require(<span style="color: #8b2252;">"dijit.form.CheckBox"</span>); 
  &lt;/<span style="color: #0000ff;">script</span>&gt;

   &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"mainTabContainer"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.layout.TabContainer"</span> <span style="color: #a0522d;">style</span>=<span style="color: #8b2252;">"width:500px;height:100px"</span>&gt;
      &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"LittleRed"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.layout.ContentPane"</span> <span style="color: #a0522d;">title</span>=<span style="color: #8b2252;">"Little Red Cap"</span>&gt;
      Once upon a time there was a dear little girl who was loved by
      every one who looked at her, but most of all by her grandmother,
      and there was nothing that she would not have given to the child.
      &lt;/<span style="color: #0000ff;">div</span>&gt;
      &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"HanselGretel"</span> <span style="color: #a0522d;">data-dojo-type</span>=<span style="color: #8b2252;">"dijit.layout.ContentPane"</span> <span style="color: #a0522d;">title</span>=<span style="color: #8b2252;">"Hansel and Gretel"</span> <span style="color: #a0522d;">closable</span>=<span style="color: #8b2252;">"true"</span> <span style="color: #a0522d;">selected</span>=<span style="color: #8b2252;">"true"</span>&gt;
      Hard by a great forest dwelt a poor wood-cutter with his wife
      and his two children. The boy was called Hansel and the girl Gretel.
      He had little to bite and to break, and once when great dearth fell
      on the land, he could no longer procure even daily bread.
      &lt;/<span style="color: #0000ff;">div</span>&gt;
   &lt;/<span style="color: #0000ff;">div</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 表格</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>代码
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html"> &lt;<span style="color: #0000ff;">style</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/css"</span>&gt;
    @import <span style="color: #8b2252;">"${pageContext.request.contextPath}/dojo/dojox/grid/resources/claroGrid.css"</span>;
 &lt;/<span style="color: #0000ff;">style</span>&gt;
 &lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javacript"</span>&gt;
     dojo.require(<span style="color: #8b2252;">"dojo.data.ItemFileReadStore"</span>);
     dojo.require(<span style="color: #8b2252;">"dojox.grid.Grid"</span>);
     dojo.require(<span style="color: #8b2252;">"dojox.grid._data.model"</span>);
     dojo.require(<span style="color: #8b2252;">"dojo.parser"</span>);
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 与javaScipt的协作</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 基本函数</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> dojo.require</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>加载除了dojo.js以外的其它功能包
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> dojo.addOnLoad</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>页面加载完毕后调用的函数
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> dojo.byId dijit.byId</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>根据表单元素id获取元素
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> dojo.query</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>返回节点列表
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> dojo.connect</h4>
<div class="outline-text-4" id="text-3-1-5">
<ul class="org-ul">
<li>监听Dijit小部件
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> dojo.forEach</h4>
<div class="outline-text-4" id="text-3-1-6">
<ul class="org-ul">
<li>遍历
</li>
<li>例子
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">dojo.query(<span style="color: #8b2252;">"select"</span>).forEach(
  <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">selectTag</span>) {
      selectTag.disabled = <span style="color: #008b8b;">true</span>;
  }
);
&lt;!-- &#31616;&#20889; --&gt;
dojo.query(<span style="color: #8b2252;">"select"</span>, document).forEach(<span style="color: #8b2252;">"item.disabled = true;"</span>);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> dom</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> dojo DOM工具函数</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>dojo.hasClass dojo.addClass dojo.removeClass dojo.toggleClass
<ul class="org-ul">
<li>对class的操作
</li>
</ul>
</li>
<li>dojo.style
<ul class="org-ul">
<li>设置结点样式
</li>
</ul>
</li>
<li>dojo.attr dojo.hasAttr dojo.removeAttr
<ul class="org-ul">
<li>对结点属性的操作
</li>
</ul>
</li>
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2013-07-17 周三 11:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.5)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
